Sovos Bulut e-Arşiv Fatura WS API 2.2/EK1 - Teknik Belgeler/e-Arşiv Fatura WS Soap istek ve Yanıt Örnekleri/sendInvoiceRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="http://fitcons.com/earchive/invoice">
   <soapenv:Header/>
   <soapenv:Body>
      <inv:sendInvoiceRequestType>
         <senderID>1111111111</senderID>
         <receiverID>2222222222</receiverID>
         <docType>XML</docType>
         <fileName>1invoice.zip</fileName>
         <hash>0DA92118C05FE99BD7114EE401C73FFA</hash>
         <binaryData>cid:10</binaryData>
         <!--Zero or more repetitions:-->
         <customizationParams>
            <!--Optional:-->
            <paramName>BRANCH</paramName>
            <!--Optional:-->
            <paramValue>default</paramValue>
         </customizationParams>
         <!--Optional:-->
         <responsiveOutput>
            <!--Optional:-->
            <outputType>PDF</outputType>
         </responsiveOutput>
      </inv:sendInvoiceRequestType>
   </soapenv:Body>
</soapenv:Envelope>